NextFOAM-2501/tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/bubbleColumnPolydisperse/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    pickCells
    {
        name    zone;
        type    cellSet;
        action  new;
        source  boxToCell;
        boxes
        (
            (0 0.4 0) (0.15 0.5 0.1)
        );
    }

    convertToZone
    {
        name    zone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     zone;
    }
);


// ************************************************************************* //
